interFoam/campagneNonUniformDiss/D050L316W045Z000Hup120Hdown086Q060_hdownMan/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "geoForCfMesh/merged.fms";

minCellSize 0.01;

maxCellSize 0.01;

//boundaryCellSize 0.01;


localRefinement
{
	obstacle
	{
		//additionalRefinementLevels 3;
	   	//cellSize 12.8E-4;
		cellSize 6.38E-4;
	   	//refinementThickness 0.01;
	}
	//obstacle
	//{
	//   cellSize 6.2551E-4;//1.251E-3;
	   //refinementThickness 0.01;
	//}
}


objectRefinements
{
	box01
	{
		type			box;
		cellSize		0.0051;
		centre			(0.3	0	0.2);
		lengthX			1.2;
		lengthY			0.79;
		lengthZ			0.4;
	}
	
	/*
	box02
	{
		type			box;
		cellSize		0.00251;
		centre			(0.2	0	0.075);
		lengthX			0.6;
		lengthY			0.65;
		lengthZ			0.15;
	}
	*/
	/*
	cone01 // around fixation
	{
		type				cone;
		cellSize			1.251E-3;
		p0				(0 0 0.05);
		p1				(0 0 0.15);
		radius0	0.01;
		radius1 0.01;
	}

	cone02 // around fixation
	{
		type				cone;
		cellSize			6.251E-4;
		p0				(0 0 0.05);
		p1				(0 0 0.15);
		radius0	0.006;
		radius1 0.006;
	}
	*/
	
	/*
	box03 // for 2 mm gap below cylinder
	{
		type			box;
		cellSize		6.251E-4;
		centre			(0	0	0.001);
		lengthX			0.01;
		lengthY			0.494;
		lengthZ			0.002;
	}
	*/
	/*
	cone03 // around cylinder
	{
		type				cone;
		cellSize			1.251E-3;// 0.00251;
		p0				(0 -0.2445 0.027);
		p1				(0 0.2445 0.027);
		radius0	0.0325;
		radius1 0.0325;
	}

	cone04 // around cylinder
	{
		type				cone;
		cellSize			6.251E-4;// 0.00251;
		p0				(0 -0.2395 0.027);
		p1				(0 0.2395 0.027);
		radius0	0.0275;
		radius1 0.0275;
	}
	*/
	
}

/*
boundaryLayers
{
	patchBoundaryLayers
	{
		obstacle
		{
			nLayers					5;
			thicknessRatio 			1;
			maxFirstLayerThickness	6.2551E-4;
			//allowDiscontinuity 1;
        }
    }
	
    optimiseLayer 1;

    optimisationParameters
    {
        nSmoothNormals                   5;
        relThicknessTol 		        0.4;
        featureSizeFactor 		0.8;
        reCalculateNormals 		1; 
        maxNumIterations 		5;
    }
	
}
*/

renameBoundary
{
	defaultType patch;
	newPatchNames
	{
		bottom
		{
			type	wall;
			newName	bottom;
		}
		obstacle
		{
			type	wall;
			newName	obstacle;
		}
		frontAndBack
		{
			type	wall;
			newName	frontAndBack;
		}
		inlet
		{
			type	patch;
			newName	inlet;
		}
		/*
		outlet
		{
			type patch;
			newName outlet;
		}
		*/
		outletAir
		{
			type	patch;
			newName	outletAir;
		}
		outletWater
		{
			type	patch;
			newName	outletWater;
		}
		
		top
		{
			type	patch;
			newName	top;
		}
		/*
		mount
		{
			type	wall;
			newName	mount;
		}
		*/
	}
}

// ************************************************************************* //
